In [1]:
#Group by

In [2]:
import numpy as np
import pandas as pd

In [3]:
data={
    'company':['google','google','tcs','tcs','microsoft','microsoft'],
    'branch':['america','itly','india','pune','germany','buldhana'],
    'salary':[112,343,543,532,554,676]
}

In [4]:
data

{'company': ['google', 'google', 'tcs', 'tcs', 'microsoft', 'microsoft'],
 'branch': ['america', 'itly', 'india', 'pune', 'germany', 'buldhana'],
 'salary': [112, 343, 543, 532, 554, 676]}

In [7]:
df=pd.DataFrame(data)

In [8]:
df

     company    branch  salary
0     google   america     112
1     google      itly     343
2        tcs     india     543
3        tcs      pune     532
4  microsoft   germany     554
5  microsoft  buldhana     676

In [9]:
df.groupby('company')

In [11]:
df=df.groupby('company')

In [12]:
df

In [13]:
df.sum()

                    branch  salary
company
google         americaitly     455
microsoft  germanybuldhana    1230
tcs              indiapune    1075

In [14]:
df.count()

           branch  salary
company
google          2       2
microsoft       2       2
tcs             2       2

In [15]:
df.min()

             branch  salary
company
google      america     112
microsoft  buldhana     554
tcs           india     532

In [16]:
df.max()

            branch  salary
company
google        itly     343
microsoft  germany     676
tcs           pune     543

In [21]:
df.sum().loc['google']

branch    americaitly
salary            455
Name: google, dtype: object

In [27]:
df.min().loc['microsoft']

branch    buldhana
salary         554
Name: microsoft, dtype: object

In [29]:
df.describe()

          salary
           count   mean         std    min     25%    50%     75%    max
company
google       2.0  227.5  163.341666  112.0  169.75  227.5  285.25  343.0
microsoft    2.0  615.0   86.267027  554.0  584.50  615.0  645.50  676.0
tcs          2.0  537.5    7.778175  532.0  534.75  537.5  540.25  543.0

In [33]:
df.describe().transpose()['google']

salary  count      2.000000
        mean     227.500000
        std      163.341666
        min      112.000000
        25%      169.750000
        50%      227.500000
        75%      285.250000
        max      343.000000
Name: google, dtype: float64